In [1]:
import pandas as pd

In [2]:
df=pd.read_csv("output.csv")

In [5]:
df['Name']#Selecting single clumns
df[['Name','Age']]#multiple cols

         Name  Age
0     Prakash   21
1      Malaya   20
2  Subhranshu   22
3       Rudra   23
4    Kaivalya   22
5     Ashrita   20
6     Abhipsa   21
7     Manohar   22

In [9]:
#Accesing specified element
print(df.at[2,'Age'])
print(df.at[4,'Name'])

22
Kaivalya

In [10]:
print(df.iat[2,2])

450000

In [11]:
#By index
df.iloc[0]

Name       Prakash
Age             21
Salary       40000
City      Banglore
Name: 0, dtype: object

In [12]:
df.loc[0]

Name       Prakash
Age             21
Salary       40000
City      Banglore
Name: 0, dtype: object

In [14]:
df.loc[1:5]

         Name  Age  Salary      City
1      Malaya   20   30000   Bhadrak
2  Subhranshu   22  450000    jajpur
3       Rudra   23   80000   Bhadrak
4    Kaivalya   22   70000    jajpur
5     Ashrita   20   30000  Cuttuack

In [22]:
#Filtering the data
f_data=df[df['Age']>22]
print(f_data)
f_data=df[(df['Age']>20)& (df['Salary']>50000)]
f_data

    Name  Age  Salary     City
3  Rudra   23   80000  Bhadrak

         Name  Age  Salary      City
2  Subhranshu   22  450000    jajpur
3       Rudra   23   80000   Bhadrak
4    Kaivalya   22   70000    jajpur
6     Abhipsa   21  400000  Cuttuack

Adding or Modifying columns

In [39]:
df['Bonus']=df['Salary']*0.1
print(df)

TypeError: 'NoneType' object is not subscriptable

In [27]:
#Modify the existing cols
df['Salary']=df['Salary']+5
df

         Name  Age  Salary      City    Bonus
0     Prakash   21   50505  Banglore   4000.0
1      Malaya   20   40505   Bhadrak   3000.0
2  Subhranshu   22  460505    jajpur  45000.0
3       Rudra   23   90505   Bhadrak   8000.0
4    Kaivalya   22   80505    jajpur   7000.0
5     Ashrita   20   40505  Cuttuack   3000.0
6     Abhipsa   21  410505  Cuttuack  40000.0
7     Manohar   22   60505     Bihar   5000.0

NoneType

None